Model: "SHM_Discriminator"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
gaussian_noise (GaussianNoise)  (None, 128, 128, 3)  0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 64, 64, 64)   1728        gaussian_noise[0][0]             
__________________________________________________________________________________________________
tf.math.reduce_mean_36 (TFOpLam (None, 1, 1, 64)     0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
tf.stop_gradient_18 (TFOpLambda (None, 1, 1, 64)     0           tf.math.reduce_mean_36[0][0]     
__________________________________________________________________________________________________
tf.math.squared_difference_18 ( (None, 64, 64, 64)   0           conv2d_27[0][0]                  
                                                                 tf.stop_gradient_18[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_mean_37 (TFOpLam (None, 1, 1, 64)     0           tf.math.squared_difference_18[0][
__________________________________________________________________________________________________
tf.__operators__.add_40 (TFOpLa (None, 1, 1, 64)     0           tf.math.reduce_mean_37[0][0]     
__________________________________________________________________________________________________
tf.math.rsqrt_18 (TFOpLambda)   (None, 1, 1, 64)     0           tf.__operators__.add_40[0][0]    
__________________________________________________________________________________________________
tf.math.multiply_54 (TFOpLambda (None, 1, 1, 64)     0           tf.math.rsqrt_18[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_56 (TFOpLambda (None, 1, 1, 64)     0           tf.math.reduce_mean_36[0][0]     
                                                                 tf.math.multiply_54[0][0]        
__________________________________________________________________________________________________
tf.cast_36 (TFOpLambda)         (None, 1, 1, 64)     0           tf.math.multiply_54[0][0]        
__________________________________________________________________________________________________
tf.math.subtract_18 (TFOpLambda (None, 1, 1, 64)     0           tf.math.multiply_56[0][0]        
__________________________________________________________________________________________________
tf.math.multiply_55 (TFOpLambda (None, 64, 64, 64)   0           conv2d_27[0][0]                  
                                                                 tf.cast_36[0][0]                 
__________________________________________________________________________________________________
tf.cast_37 (TFOpLambda)         (None, 1, 1, 64)     0           tf.math.subtract_18[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_41 (TFOpLa (None, 64, 64, 64)   0           tf.math.multiply_55[0][0]        
                                                                 tf.cast_37[0][0]                 
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 32, 32, 128)  73728       tf.__operators__.add_41[0][0]    
__________________________________________________________________________________________________
tf.math.reduce_mean_38 (TFOpLam (None, 1, 1, 128)    0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
tf.stop_gradient_19 (TFOpLambda (None, 1, 1, 128)    0           tf.math.reduce_mean_38[0][0]     
__________________________________________________________________________________________________
tf.math.squared_difference_19 ( (None, 32, 32, 128)  0           conv2d_28[0][0]                  
                                                                 tf.stop_gradient_19[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_mean_39 (TFOpLam (None, 1, 1, 128)    0           tf.math.squared_difference_19[0][
__________________________________________________________________________________________________
tf.__operators__.add_42 (TFOpLa (None, 1, 1, 128)    0           tf.math.reduce_mean_39[0][0]     
__________________________________________________________________________________________________
tf.math.rsqrt_19 (TFOpLambda)   (None, 1, 1, 128)    0           tf.__operators__.add_42[0][0]    
__________________________________________________________________________________________________
tf.math.multiply_57 (TFOpLambda (None, 1, 1, 128)    0           tf.math.rsqrt_19[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_59 (TFOpLambda (None, 1, 1, 128)    0           tf.math.reduce_mean_38[0][0]     
                                                                 tf.math.multiply_57[0][0]        
__________________________________________________________________________________________________
tf.cast_38 (TFOpLambda)         (None, 1, 1, 128)    0           tf.math.multiply_57[0][0]        
__________________________________________________________________________________________________
tf.math.subtract_19 (TFOpLambda (None, 1, 1, 128)    0           tf.math.multiply_59[0][0]        
__________________________________________________________________________________________________
tf.math.multiply_58 (TFOpLambda (None, 32, 32, 128)  0           conv2d_28[0][0]                  
                                                                 tf.cast_38[0][0]                 
__________________________________________________________________________________________________
tf.cast_39 (TFOpLambda)         (None, 1, 1, 128)    0           tf.math.subtract_19[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_43 (TFOpLa (None, 32, 32, 128)  0           tf.math.multiply_58[0][0]        
                                                                 tf.cast_39[0][0]                 
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 16, 16, 256)  294912      tf.__operators__.add_43[0][0]    
__________________________________________________________________________________________________
tf.math.reduce_mean_40 (TFOpLam (None, 1, 1, 256)    0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
tf.stop_gradient_20 (TFOpLambda (None, 1, 1, 256)    0           tf.math.reduce_mean_40[0][0]     
__________________________________________________________________________________________________
tf.math.squared_difference_20 ( (None, 16, 16, 256)  0           conv2d_29[0][0]                  
                                                                 tf.stop_gradient_20[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_mean_41 (TFOpLam (None, 1, 1, 256)    0           tf.math.squared_difference_20[0][
__________________________________________________________________________________________________
tf.__operators__.add_44 (TFOpLa (None, 1, 1, 256)    0           tf.math.reduce_mean_41[0][0]     
__________________________________________________________________________________________________
tf.math.rsqrt_20 (TFOpLambda)   (None, 1, 1, 256)    0           tf.__operators__.add_44[0][0]    
__________________________________________________________________________________________________
tf.math.multiply_60 (TFOpLambda (None, 1, 1, 256)    0           tf.math.rsqrt_20[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_62 (TFOpLambda (None, 1, 1, 256)    0           tf.math.reduce_mean_40[0][0]     
                                                                 tf.math.multiply_60[0][0]        
__________________________________________________________________________________________________
tf.cast_40 (TFOpLambda)         (None, 1, 1, 256)    0           tf.math.multiply_60[0][0]        
__________________________________________________________________________________________________
tf.math.subtract_20 (TFOpLambda (None, 1, 1, 256)    0           tf.math.multiply_62[0][0]        
__________________________________________________________________________________________________
tf.math.multiply_61 (TFOpLambda (None, 16, 16, 256)  0           conv2d_29[0][0]                  
                                                                 tf.cast_40[0][0]                 
__________________________________________________________________________________________________
tf.cast_41 (TFOpLambda)         (None, 1, 1, 256)    0           tf.math.subtract_20[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_45 (TFOpLa (None, 16, 16, 256)  0           tf.math.multiply_61[0][0]        
                                                                 tf.cast_41[0][0]                 
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 8, 8, 512)    1179648     tf.__operators__.add_45[0][0]    
__________________________________________________________________________________________________
tf.math.reduce_mean_42 (TFOpLam (None, 1, 1, 512)    0           conv2d_30[0][0]                  
__________________________________________________________________________________________________
tf.stop_gradient_21 (TFOpLambda (None, 1, 1, 512)    0           tf.math.reduce_mean_42[0][0]     
__________________________________________________________________________________________________
tf.math.squared_difference_21 ( (None, 8, 8, 512)    0           conv2d_30[0][0]                  
                                                                 tf.stop_gradient_21[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_mean_43 (TFOpLam (None, 1, 1, 512)    0           tf.math.squared_difference_21[0][
__________________________________________________________________________________________________
tf.__operators__.add_46 (TFOpLa (None, 1, 1, 512)    0           tf.math.reduce_mean_43[0][0]     
__________________________________________________________________________________________________
tf.math.rsqrt_21 (TFOpLambda)   (None, 1, 1, 512)    0           tf.__operators__.add_46[0][0]    
__________________________________________________________________________________________________
tf.math.multiply_63 (TFOpLambda (None, 1, 1, 512)    0           tf.math.rsqrt_21[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_65 (TFOpLambda (None, 1, 1, 512)    0           tf.math.reduce_mean_42[0][0]     
                                                                 tf.math.multiply_63[0][0]        
__________________________________________________________________________________________________
tf.cast_42 (TFOpLambda)         (None, 1, 1, 512)    0           tf.math.multiply_63[0][0]        
__________________________________________________________________________________________________
tf.math.subtract_21 (TFOpLambda (None, 1, 1, 512)    0           tf.math.multiply_65[0][0]        
__________________________________________________________________________________________________
tf.math.multiply_64 (TFOpLambda (None, 8, 8, 512)    0           conv2d_30[0][0]                  
                                                                 tf.cast_42[0][0]                 
__________________________________________________________________________________________________
tf.cast_43 (TFOpLambda)         (None, 1, 1, 512)    0           tf.math.subtract_21[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_47 (TFOpLa (None, 8, 8, 512)    0           tf.math.multiply_64[0][0]        
                                                                 tf.cast_43[0][0]                 
__________________________________________________________________________________________________
tf.__operators__.add_48 (TFOpLa (None, 8, 8, 512)    0           tf.__operators__.add_47[0][0]    
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 4, 4, 1024)   4718592     tf.__operators__.add_48[0][0]    
__________________________________________________________________________________________________
tf.math.reduce_mean_44 (TFOpLam (None, 1, 1, 1024)   0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
tf.stop_gradient_22 (TFOpLambda (None, 1, 1, 1024)   0           tf.math.reduce_mean_44[0][0]     
__________________________________________________________________________________________________
tf.math.squared_difference_22 ( (None, 4, 4, 1024)   0           conv2d_33[0][0]                  
                                                                 tf.stop_gradient_22[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_mean_45 (TFOpLam (None, 1, 1, 1024)   0           tf.math.squared_difference_22[0][
__________________________________________________________________________________________________
tf.__operators__.add_49 (TFOpLa (None, 1, 1, 1024)   0           tf.math.reduce_mean_45[0][0]     
__________________________________________________________________________________________________
tf.math.rsqrt_22 (TFOpLambda)   (None, 1, 1, 1024)   0           tf.__operators__.add_49[0][0]    
__________________________________________________________________________________________________
tf.math.multiply_66 (TFOpLambda (None, 1, 1, 1024)   0           tf.math.rsqrt_22[0][0]           
__________________________________________________________________________________________________
tf.math.multiply_68 (TFOpLambda (None, 1, 1, 1024)   0           tf.math.reduce_mean_44[0][0]     
                                                                 tf.math.multiply_66[0][0]        
__________________________________________________________________________________________________
tf.cast_44 (TFOpLambda)         (None, 1, 1, 1024)   0           tf.math.multiply_66[0][0]        
__________________________________________________________________________________________________
tf.math.subtract_22 (TFOpLambda (None, 1, 1, 1024)   0           tf.math.multiply_68[0][0]        
__________________________________________________________________________________________________
tf.math.multiply_67 (TFOpLambda (None, 4, 4, 1024)   0           conv2d_33[0][0]                  
                                                                 tf.cast_44[0][0]                 
__________________________________________________________________________________________________
tf.cast_45 (TFOpLambda)         (None, 1, 1, 1024)   0           tf.math.subtract_22[0][0]        
__________________________________________________________________________________________________
tf.__operators__.add_50 (TFOpLa (None, 4, 4, 1024)   0           tf.math.multiply_67[0][0]        
                                                                 tf.cast_45[0][0]                 
__________________________________________________________________________________________________
dropout (Dropout)               (None, 4, 4, 1024)   0           tf.__operators__.add_50[0][0]    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 16384)        0           dropout[0][0]                    
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 4, 4, 1)      9216        dropout[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 5)            81920       flatten[0][0]                    
==================================================================================================
Total params: 6,359,744
Trainable params: 6,359,744
Non-trainable params: 0
__________________________________________________________________________________________________
